requests/country_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:updateCountryRequest>
         <gs:name>Pakistan</gs:name>
	 <gs:capital>Islamabad</gs:capital>
	 <gs:population>18299</gs:population>
	 <gs:currency>PNR</gs:currency>
      </gs:updateCountryRequest>
   </soapenv:Body>
</soapenv:Envelope>
